#!/usr/bin/env python
# -*- coding: UTF-8 -*-
"""
@File    :   morse_code.py
@Time    :   2025/04/10 14:20:32
@Desc    :   摩斯密码
"""


# 摩斯码规则
# 点（.）：短音（"滴"），占1个单位时间。
# 划（-）：长音（"嗒"），占3个单位时间。
# 字符内间隔：同一字母/数字的点划之间，间隔1个单位时间。
# 字符间间隔：不同字母/数字之间，间隔3个单位时间。
# 单词间间隔：不同单词之间，间隔7个单位时间。

from typing import Literal


def transform_morse(chars: str, mode: Literal["decode", "encode"] = "decode") -> str:
    """摩斯密码解码与编码"""
    # 摩斯密码字典表
    # fmt: off
    char_morse = {
        # 空格
        " ": "/",
        # 字母
        "A": ".-", "B": "-...", "C": "-.-.", "D": "-..", "E": ".", "F": "..-.",
        "G": "--.", "H": "....", "I": "..", "J": ".---", "K": "-.-", "L": ".-..",
        "M": "--", "N": "-.", "O": "---", "P": ".--.", "Q": "--.-", "R": ".-.",
        "S": "...", "T": "-", "U": "..-", "V": "...-", "W": ".--", "X": "-..-",
        "Y": "-.--", "Z": "--..",
        # 数字
        "0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-",
        "5": ".....", "6": "-....", "7": "--...", "8": "---..", "9": "----.",
        # 符号
        ",": "--..--", ".": ".-.-.-", "?": "..--..", "!": "-.-.--", "/": "-..-.",
        "(": "-.--.", ")": "-.--.-", "&": ".-...", ":": "---...", ";": "-.-.-.",
        "=": "-...-", "+": ".-.-.", "-": "-....-", "_": "..--.-", '"': ".-..-.",
        "$": "...-..-", "@": ".--.-.", "'": ".----.",
    }
    # fmt: on
    if mode == "decode":
        # 解码逻辑：将摩斯码转换为文本
        morse_char = {morse: char for char, morse in char_morse.items()}
        return "".join([morse_char.get(i, "") for i in chars.split()])
    elif mode == "encode":
        # 编码逻辑：将文本转换为摩斯码
        return " ".join(char_morse.get(i, "") for i in chars.upper())

    return chars


print(
    transform_morse(".. / .-.. --- ...- . / -.-- --- ..-"),
    transform_morse("I love you", "encode"),
)
